# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь
n=input("Введите трёхзначное число:")
a=int(n[0])
b=int(n[1])
c=int(n[2])
print(f"Сумма чисел {a},{b},{c}: {a+b+c}")
print(f"Произведение чисел {a},{b},{c}:{a*b*c}")
